## Feature Engineering

In [3]:
import pandas as pd
from keras.utils import np_utils
from sklearn import preprocessing

In [4]:
y_train  = pd.read_csv('../../data/raw/y_train.csv')

demographic = pd.read_csv('../../data/raw/demo.csv')
address = pd.read_csv('../../data/raw/adr.csv')

saving_acc = pd.read_csv('../../data/raw/sa.csv')
cc_transaction = pd.read_csv('../../data/raw/cc_txn.csv')

In [5]:
y_train.shape

(6361, 2)

### Demographic

In [6]:
print(demographic.shape)
demographic.head()

(10299, 10)

,ip_id,brth_yr,act_strt_dt,no_of_dpnd_chl,cis_income,crn_bal,gnd_cd,mar_st_cd,ctf_tp_cd,ocp_cd
0,1,1990.0,2011-12-11,0.0,45864.0,876428.0,2.0,2.0,3.0,9
1,2,1986.0,2010-06-08,1.0,43355.0,540649.0,2.0,2.0,1.0,3
2,3,1983.0,2013-12-06,0.0,48836.0,310503.0,2.0,2.0,2.0,12
3,4,1984.0,2009-12-27,0.0,44397.0,34209.0,2.0,2.0,5.0,11
4,5,1986.0,2006-09-01,1.0,43281.0,39963.0,2.0,3.0,6.0,9

ตัด field ที่คิดว่าไม่มีผลออก act_strt_dt

In [7]:
demographic['brth_yr'].unique()

array([1990., 1986., 1983., 1984., 1987., 1976., 1971., 1974., 1975.,
       1981., 1977., 1978., 1980., 1973., 1982., 1979., 1985., 1972.,
       1989., 1969., 1991., 1967., 1996., 1965., 1988., 1970., 1968.,
       1992., 1993., 1994., 1966., 1995., 1998., 1997., 1944., 1962.,
       1956., 1957., 1964., 2003., 2005., 1934., 1961., 1999., 1960.,
       1947., 1943., 1958., 1938., 2000., 1949., 1955., 1963., 1959.,
       1953., 2004., 1941., 1951., 1946., 1948., 1937., 2002., 1942.,
       1939., 1954., 1945., 1931., 1930., 2001.])

In [8]:
demographic['gnd_cd'].unique()

array([2., 1.])

In [9]:
demographic['mar_st_cd'].unique()

array([2., 3., 4., 1.])

In [10]:
demographic['ctf_tp_cd'].unique()

array([3., 1., 2., 5., 6., 4.])

In [11]:
demographic['ocp_cd'].unique()

array([ 9,  3, 12, 11,  6,  2,  7,  4,  1,  5,  8])

แก้ปีเกิดเป็นอายุ

In [12]:
new_demograp = demographic.copy()
new_demograp['age'] = 2018 - new_demograp['brth_yr']

del new_demograp['act_strt_dt']
del new_demograp['brth_yr']

อันนี้เป็น feature ละ พร้อม merge (อาจทำ one-not ก่อน)

In [13]:
new_demograp.head()

,ip_id,no_of_dpnd_chl,cis_income,crn_bal,gnd_cd,mar_st_cd,ctf_tp_cd,ocp_cd,age
0,1,0.0,45864.0,876428.0,2.0,2.0,3.0,9,28.0
1,2,1.0,43355.0,540649.0,2.0,2.0,1.0,3,32.0
2,3,0.0,48836.0,310503.0,2.0,2.0,2.0,12,35.0
3,4,0.0,44397.0,34209.0,2.0,2.0,5.0,11,34.0
4,5,1.0,43281.0,39963.0,2.0,3.0,6.0,9,32.0

gender

In [52]:
en_gender = preprocessing.LabelEncoder()
en_gender.fit(new_demograp['gnd_cd'].unique())

end_gender = en_gender.transform(new_demograp['gnd_cd'])
# convert integers to dummy variables (i.e. one hot encoded)
dummy_gender = np_utils.to_categorical(end_gender)

In [57]:
new_demograp['dummy_gnd_cd'] = tuple(dummy_gender)

Marital status code

In [59]:
en_mar = preprocessing.LabelEncoder()
en_mar.fit(new_demograp['mar_st_cd'].unique())

end_mar = en_mar.transform(new_demograp['mar_st_cd'])

# convert integers to dummy variables (i.e. one hot encoded)
dummy_mar = np_utils.to_categorical(end_mar)

In [60]:
new_demograp['dummy_mar_st_cd'] = tuple(dummy_mar)

Education level code

In [62]:
en_edu = preprocessing.LabelEncoder()
en_edu.fit(new_demograp['ctf_tp_cd'].unique())

end_edu = en_edu.transform(new_demograp['ctf_tp_cd'])

# convert integers to dummy variables (i.e. one hot encoded)
dummy_edu = np_utils.to_categorical(end_edu)

In [63]:
new_demograp['dummy_ctf_tp_cd'] = tuple(dummy_edu)

Occupation code

In [65]:
en_ocp = preprocessing.LabelEncoder()
en_ocp.fit(new_demograp['ocp_cd'].unique())

end_ocp = en_ocp.transform(new_demograp['ocp_cd'])

# convert integers to dummy variables (i.e. one hot encoded)
dummy_ocp = np_utils.to_categorical(end_ocp)

In [68]:
new_demograp['dummy_ocp_cd'] = tuple(dummy_ocp)

In [71]:
# del new_demograp['gnd_cd']
# del new_demograp['mar_st_cd']
# del new_demograp['ctf_tp_cd']
# del new_demograp['ocp_cd']

In [133]:
new_demograp.head()

,ip_id,no_of_dpnd_chl,cis_income,crn_bal,age,dummy_gnd_cd,dummy_mar_st_cd,dummy_ctf_tp_cd,dummy_ocp_cd
0,1,0.0,45864.0,876428.0,28.0,"(0.0, 1.0)","(0.0, 1.0, 0.0, 0.0)","(0.0, 0.0, 1.0, 0.0, 0.0, 0.0)","(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, ..."
1,2,1.0,43355.0,540649.0,32.0,"(0.0, 1.0)","(0.0, 1.0, 0.0, 0.0)","(1.0, 0.0, 0.0, 0.0, 0.0, 0.0)","(0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ..."
2,3,0.0,48836.0,310503.0,35.0,"(0.0, 1.0)","(0.0, 1.0, 0.0, 0.0)","(0.0, 1.0, 0.0, 0.0, 0.0, 0.0)","(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ..."
3,4,0.0,44397.0,34209.0,34.0,"(0.0, 1.0)","(0.0, 1.0, 0.0, 0.0)","(0.0, 0.0, 0.0, 0.0, 1.0, 0.0)","(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, ..."
4,5,1.0,43281.0,39963.0,32.0,"(0.0, 1.0)","(0.0, 0.0, 1.0, 0.0)","(0.0, 0.0, 0.0, 0.0, 0.0, 1.0)","(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, ..."

In [140]:
demograp_feature = new_demograp.copy()

In [143]:
demograp_feature['gnd_cd'] = (demographic['gnd_cd'] == 2).astype(int)

In [146]:
married_df = new_demograp['dummy_mar_st_cd'].apply(pd.Series)

In [149]:
# demograp_feature = pd.concat([demograp_feature, married_df], axis=1, join_axes=[demograp_feature.index])

In [151]:
education_df = new_demograp['dummy_ctf_tp_cd'].apply(pd.Series)

In [156]:
# demograp_feature = pd.concat([demograp_feature, education_df], axis=1, join_axes=[demograp_feature.index])

In [157]:
ocupation_df = new_demograp['dummy_ocp_cd'].apply(pd.Series)

In [158]:
# demograp_feature = pd.concat([demograp_feature, ocupation_df], axis=1, join_axes=[demograp_feature.index])

In [160]:
demograp_feature.shape

(10299, 31)

In [163]:
# del demograp_feature['dummy_gnd_cd']
# del demograp_feature['dummy_mar_st_cd']
# del demograp_feature['dummy_ctf_tp_cd']
# del demograp_feature['dummy_ocp_cd']

In [165]:
demograp_feature.shape

(10299, 27)

In [167]:
demograp_feature.head()

,ip_id,no_of_dpnd_chl,cis_income,crn_bal,age,gnd_cd,0,1,2,3,...,1,2,3,4,5,6,7,8,9,10
0,1,0.0,45864.0,876428.0,28.0,1,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
1,2,1.0,43355.0,540649.0,32.0,1,0.0,1.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,0.0,48836.0,310503.0,35.0,1,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
3,4,0.0,44397.0,34209.0,34.0,1,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
4,5,1.0,43281.0,39963.0,32.0,1,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0

In [169]:
demograp_feature.to_csv('../../data/feature_vector/all/demo.csv', index=False)

### Province

71 จังหวัด

In [14]:
new_address = address.copy()
new_address.shape

(4737, 2)

In [15]:
new_address['prov'] = new_address['prov'].apply(lambda x: x.strip())

province = new_address['prov'].unique()
province.shape

(71,)

In [76]:
en_prov = preprocessing.LabelEncoder()
en_prov.fit(new_address['prov'].unique())

end_prov = en_prov.transform(new_address['prov'])

# convert integers to dummy variables (i.e. one hot encoded)
dummy_prov = np_utils.to_categorical(end_prov)

In [79]:
en_prov.classes_

array(['กทม.', 'กระบี่', 'กาญจนบุรี', 'กาฬสินธุ์', 'กำแพงเพชร', 'ขอนแก่น',
       'จันทบุรี', 'ฉะเชิงเทรา', 'ชลบุรี', 'ชัยนาท', 'ชัยภูมิ', 'ชุมพร',
       'ตรัง', 'ตราด', 'ตาก', 'นครนายก', 'นครปฐม', 'นครพนม', 'นครราชสีมา',
       'นครศรีธรรมราช', 'นครสวรรค์', 'นนทบุรี', 'นราธิวาส', 'น่าน',
       'บึงกาฬ', 'บุรีรัมย์', 'ปทุมธานี', 'ประจวบคีรีขันธ์', 'ปราจีนบุรี',
       'ปัตตานี', 'พระนครศรีอยุธยา', 'พะเยา', 'พังงา', 'พัทลุง', 'พิจิตร',
       'พิษณุโลก', 'ภูเก็ต', 'มหาสารคาม', 'มุกดาหาร', 'ยโสธร', 'ระนอง',
       'ระยอง', 'ราชบุรี', 'ร้อยเอ็ด', 'ลพบุรี', 'ลำปาง', 'ลำพูน',
       'ศรีสะเกษ', 'สกลนคร', 'สงขลา', 'สมุทรปราการ', 'สมุทรสงคราม',
       'สมุทรสาคร', 'สระบุรี', 'สระแก้ว', 'สิงห์บุรี', 'สุพรรณบุรี',
       'สุราษฎร์ธานี', 'สุรินทร์', 'หนองคาย', 'หนองบัวลำภู', 'อุดรธานี',
       'อุตรดิตถ์', 'อุบลราชธานี', 'อ่างทอง', 'เชียงราย', 'เชียงใหม่',
       'เพชรบูรณ์', 'เลย', 'แพร่', 'แม่ฮ่องสอน'], dtype=object)

In [78]:
dummy_prov.shape

(4737, 71)

In [80]:
new_address['dummy_prov'] = tuple(dummy_prov)

In [91]:
# del new_address['prov']
# del new_address['prov_no']

In [121]:
prov_df = new_address['dummy_prov'].apply(pd.Series)

In [125]:
address_feature = pd.concat([new_address, prov_df], axis=1, join_axes=[new_address.index])

In [127]:
# del address_feature['dummy_prov']

In [130]:
address_feature_per_id = address_feature.groupby('ip_id').sum()
address_feature_per_id.to_csv('../../data/feature_vector/all/prov.csv')

## Saving Account

In [24]:
saving_acc.head()

   ip_id          dt channel  tp     amt
0      1  2017-02-06     EDC  DR  1045.0
1      1  2017-02-28  Branch  CR   995.0
2      1  2017-03-15   KPlus  DR  6311.0
3      1  2017-03-22   KPlus  CR   884.0
4      1  2017-03-26  Branch  DR  4890.0

In [25]:
new_saving_acc = saving_acc.copy()
new_saving_acc.shape

(478658, 5)

In [26]:
channel = new_saving_acc['channel'].unique()
channel

array(['EDC', 'Branch', 'KPlus', 'ATM', 'CDM', 'CorporateConnect'],
      dtype=object)

In [27]:
encoder2 = preprocessing.LabelEncoder()
encoder2.fit(channel)
encoder2.classes_

array(['ATM', 'Branch', 'CDM', 'CorporateConnect', 'EDC', 'KPlus'],
      dtype=object)

In [28]:
new_saving_acc['chanel_no'] = new_saving_acc['channel'].apply(lambda x: encoder2.transform([x])[0] ) ## แปลง text เป็นตัวเลข 1,2,3,...,71

In [29]:
new_saving_acc.head()

   ip_id          dt channel  tp     amt  chanel_no
0      1  2017-02-06     EDC  DR  1045.0          4
1      1  2017-02-28  Branch  CR   995.0          1
2      1  2017-03-15   KPlus  DR  6311.0          5
3      1  2017-03-22   KPlus  CR   884.0          5
4      1  2017-03-26  Branch  DR  4890.0          1

In [30]:
type_of_transaction = saving_acc['tp'].unique()
type_of_transaction

array(['DR', 'CR'], dtype=object)

In [31]:
encoder3 = preprocessing.LabelEncoder()
encoder3.fit(type_of_transaction)
encoder3.classes_

array(['CR', 'DR'], dtype=object)

In [32]:
new_saving_acc['tp_no'] = new_saving_acc['tp'].apply(lambda x: encoder3.transform([x])[0] ) ## แปลง text เป็นตัวเลข 1,2,3,...,71

ลบ field ที่คิดว่าไม่ได้ใช้

In [33]:
# del new_saving_acc['dt'] 
del new_saving_acc['channel'] 
del new_saving_acc['tp']

In [34]:
new_saving_acc.head()

   ip_id          dt     amt  chanel_no  tp_no
0      1  2017-02-06  1045.0          4      1
1      1  2017-02-28   995.0          1      0
2      1  2017-03-15  6311.0          5      1
3      1  2017-03-22   884.0          5      0
4      1  2017-03-26  4890.0          1      1

In [35]:
new_saving_acc.groupby(['ip_id','chanel_no','tp_no']).mean().head()

                               amt
ip_id chanel_no tp_no
1     0         0      6407.000000
                1      2616.250000
      1         0      2664.333333
                1      4946.800000
      2         0      5653.428571

## Transaction

In [36]:
cc_transaction.head()

   ip_id          dt category   card  txn_amt
0      1  2017-02-02     cat2  card1  13150.0
1      1  2017-02-06    cat15  card2   9786.0
2      1  2017-02-12     cat2  card1  11165.0
3      1  2017-02-15    cat15  card1   8948.0
4      1  2017-02-18     cat3  card2   4609.0

In [37]:
new_cc_transaction = cc_transaction.copy()
new_cc_transaction.shape

(627894, 5)

In [38]:
category = new_cc_transaction['category'].unique()
category

array(['cat2', 'cat15', 'cat3', 'cat8', 'cat7', 'cat14', 'cat11', 'cat10',
       'cat9', 'cat4', 'cat1', 'cat16', 'cat5', 'cat6', 'cat12', 'cat13'],
      dtype=object)

In [39]:
encoder4 = preprocessing.LabelEncoder()
encoder4.fit(category)
encoder4.classes_

array(['cat1', 'cat10', 'cat11', 'cat12', 'cat13', 'cat14', 'cat15',
       'cat16', 'cat2', 'cat3', 'cat4', 'cat5', 'cat6', 'cat7', 'cat8',
       'cat9'], dtype=object)

In [41]:
new_cc_transaction['category_no'] = new_cc_transaction['category'].apply(lambda x: encoder4.transform([x])[0] ) ## แปลง text เป็นตัวเลข 1,2,3,...,71

In [42]:
new_cc_transaction.head()

   ip_id          dt category   card  txn_amt  category_no
0      1  2017-02-02     cat2  card1  13150.0            8
1      1  2017-02-06    cat15  card2   9786.0            6
2      1  2017-02-12     cat2  card1  11165.0            8
3      1  2017-02-15    cat15  card1   8948.0            6
4      1  2017-02-18     cat3  card2   4609.0            9

In [44]:
card = new_cc_transaction['card'].unique()
card

array(['card1', 'card2', 'card3'], dtype=object)

In [45]:
encoder5 = preprocessing.LabelEncoder()
encoder5.fit(card)
encoder5.classes_

array(['card1', 'card2', 'card3'], dtype=object)

In [46]:
new_cc_transaction['card_no'] = new_cc_transaction['card'].apply(lambda x: encoder5.transform([x])[0] ) ## แปลง text เป็นตัวเลข 1,2,3,...,71

In [47]:
new_cc_transaction.head()

   ip_id          dt category   card  txn_amt  category_no  card_no
0      1  2017-02-02     cat2  card1  13150.0            8        0
1      1  2017-02-06    cat15  card2   9786.0            6        1
2      1  2017-02-12     cat2  card1  11165.0            8        0
3      1  2017-02-15    cat15  card1   8948.0            6        0
4      1  2017-02-18     cat3  card2   4609.0            9        1

In [48]:
# del new_cc_transaction['category'] 
# del new_cc_transaction['card'] 
# del new_cc_transaction['dt']

In [50]:
new_cc_transaction.groupby(['ip_id','category_no','card_no']).mean().head()

                           txn_amt
ip_id category_no card_no
1     0           0        3962.00
                  1        1447.00
      1           1        2875.00
      2           0        9190.25
                  1        9551.00